ci4-app/app/Controllers/Admin/Article.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id` = `artikel`.`kategori_id`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new ArticleModel();
        $articles = $model->select('artikel.*, kategori.nama_kategori')
                          ->join('kategori', 'kategori.id = artikel.kategori_id')
                          ->orderBy('created_at', 'DESC')
                          ->findAll();