ci4-app/app/Controllers/Admin/Notification.php

SELECT *
FROM `settings`
WHERE `settings`.`id` = 1
---
    public function settings()
    {
        $model = new SettingModel();
        return $this->respond([
            'status' => 'success',
            'data'   => $model->find(1)