ci4-app/app/Controllers/Admin/UserManagement.php

    public function index()
    {
        $model = new UserModel();
        // Hide password hash
        $users = $model->select('id, name, email, role, is_active, created_at, updated_at')->findAll();
---
SELECT `id`, `name`, `email`, `role`, `is_active`, `created_at`, `updated_at`
FROM `users`